[
  {
    "question": "Como vai ser a minha próxima semanas de estudo de programação?",
    "notes": "<ol start=\"56\"><li><p>De seguida está um estudo dos hexagramas 47 (exaustão, opressão) e 56 (o errante). </p></li></ol><p></p><p>Contexto</p><p></p><p>Os últimos meses de aprendizagem têm sido bons, mas ultimamente têm, de facto, trazido alguma exaustão, e  a continuação desta aprendizagem errante parece ser a resposta, com as devidas precauções.</p><p></p><p>Em primeiro lugar, diria que ambos os hexagramas têm diferenças subtis e alguma complementaridade. Apenas a primeira linha é quebrada nos dois hexagramas, de resto toda as linhas são diferentes. Isto pode indicar que apesar das coisas por vezes parecerem idênticas, podem ser na verdade mais do que isso, complementares. Diria que o meu caminho no futuro terá muitas das questões que existiram até agora, o errante naturalmente que se sentirá exausto.</p><p></p><p>Sobre a Exaustão</p><p></p><p>O julgamento parece indicar opressão, mas também sucesso e algum auspício, tal como ausência de culpa. O que indica que esta exaustão poderá trazer algo bom. Todavia existe descrédito, pois não nos ouvem. No fundo, a desconfiança natural por parte desta opção algo inusitada da minha parte, desconfiança que existe em mim e certamente naqueles que comigo se preocupam.</p><p></p><p>A imagem revela-nos um lago vazio. Há o perigo e a necessidade do homem pôr a sua vida em risco, ao seguir a sua vontade. Esta imagem é bastante próxima daquela que me levou a decidir-me a programar, após todas as frustrações com trabalhos anteriores. Não parece ser tão auspiciosa como o julgamento, mas indica a necessidade de passar por riscos para que a nossa vontade seja feita.</p><p></p><p>A primeira linha indica alguém num cenário desolador, num vale sombrio junto a árvores despidas, durante três anos. Mais uma vez, ressoa na minha experiência, pois os últimos três anos tiveram esse carácter desolador. O lago vazio.</p><p></p><p>A segunda linha é mais literal e de difícil interpretação, há opressão na nossa comodidade. Poderá ter a ver com o facto de estar a viver na casa dos meus pais, o sacrifício pode ser o de ter mais gastos ao ter-me mudado para Santa Cruz. O aviso quanto à partida, ressoa na minha recusa em ligar-me a Lisboa, com medo de voltar a ter a vontade de para lá voltar. Todavia o homem com faixas vermelhas nos joelhos é uma incógnita, podendo apenas ser o peso da responsabilidade a pedir justificações. Sacrificar o meu tempo e segurança por isso, pode ser auspicioso.</p><p></p><p>A terceira linha também ressoa na solidão e na vida eremita, em que não falta a pedra das escarpas, os espinhos das silvas e os múltiplos cardos. Não ter ninguém também é um peso de um modo geral, e uma situação que em muito também testa a minha força de vontade no que toca a levar esta aprendizagem adiante. A ideia de infortúnio é bastante poética neste sentido, pois reflecte o conflito entre a minha recusa pela vida social e pelo conforto dos amigos ou de algo mais, e a minha reclusão para junto da praia e das escarpas, dos quais tento tirar um consolo que jamais me poderão dar.</p><p></p><p>Mais uma vez a linha quatro é bastante literal, dizendo que alguém vem sorrateiramente, numa carruagem dourada. Presumo que se refira ao misterioso homem de faixas vermelhas nos joelhos. Poderá indicar o peso da responsabilidade e a opressão do mesmo, na carruagem dourada que significa a estabilidade económica. Mas fica a incógnita, se a chegada destes fatores traz a opressão, ou se a incapacidade de lidar com estes é a causa. A humilhação leva-me a pensar na segunda, o fim ser conseguido leva-me a pensar na primeira. De qualquer modo, pegando nesta ideia geral, consigo ver o meu estado atual. Antes tivemos o auspício de que o homem estava a chegar, desta vez chegou e trouxe humilhação. A carruagem também remete para o meu carro, sendo este também uma das fontes de preocupações que tive ao longo dos anos e que neste momento estou a ter. </p><p></p><p>Nesta linha há uma espécie de catarse, em que através da mutilação do nariz e dos pés, o homem com faixas vermelhas finalmente concretiza a iminente opressão, conduzindo, todavia, à alegria e a uma espécie de libertação. Se continuarmos com a associação deste homem ao peso da responsabilidade, os pés cortados são as minhas limitações no que diz respeito a viajar ou deambular por aí nesta altura pelas limitações em termos de trabalho e de dinheiro, já o nariz cortado é a minha incapacidade de respirar livremente sabendo que as tenho as condições necessárias asseguradas. Mais uma vez é um tempo propício para oferendas e libações, em que talvez sinal que apesar das limitações serem avassaladoras, a alegria virá como resultado desse sacrifício que for feito.</p><p></p><p>A linha final é extremamente poética e oiço bastante ecos meus nela. Desde logo as vides trepadeiras longas e sinuosas que a tudo constringem. Sob a restrição de tais condicionantes, é-nos dito que o movimento traz remorso. Mas que após reflexão e aceitação desse remorso, a vontade de começar trará boa fortuna. O caminho parece ser assim, não só aproveitar este momento para sacrificarmo-nos por algo maior, neste caso em aprender para poder assegurar as minhas condições, como também compreendê-lo e pensá-lo bem. Sem pressas excessivas, quando reflectirmos e sentirmos a vontade de começar, a boa fortuna chega. </p><p></p><p>47.</p><p>Julgamento</p><p>OPRESSÃO. Sucesso. Perseverança.</p><p>O grande homem traz a boa fortuna. </p><p>Sem culpa. </p><p>Quando temos algo a dizer,</p><p>Não acreditam.</p><p></p><p>Imagem</p><p>Não existe água no lago:</p><p>A imagem da EXAUSTÃO</p><p>Assim o homem superior põe a sua vida em risco</p><p>Ao seguir a sua vontade.</p><p></p><p>1</p><p>Seis no início significa:</p><p>Alguém senta-se oprimido debaixo de uma árvore despida</p><p>E perde-se num vale sombrio</p><p>Por três anos não vê nada</p><p></p><p>2</p><p>Nova no segundo lugar significa:</p><p>Alguém é oprimido enquanto come e bebe.</p><p>O homem com faixas vermelhas nos joelhos está a chegar.</p><p>É propício oferecer um sacrifício</p><p>Partir traz desgraça. (ou infortúnio)</p><p>Sem culpa.</p><p></p><p>3</p><p>Seis na terceira casa significa:</p><p>O homem permite a si mesmo ser oprimido pela pedra,</p><p>E inclina-se sobre espinhos e cardos.</p><p>Ele entra na sua casa e não vê a sua mulher.</p><p>Infortúnio.</p><p></p><p></p><p>4</p><p>Nove no quarto lugar significa:</p><p>Ele vem muito sorrateiramente, oprimido numa carruagem dourada</p><p>Humilhação, mas o fim é conseguido.</p><p>5</p><p>Nove no quinto lugar significa:</p><p>O seu nariz e pés são cortados.</p><p>A opressão às mãos do homem com faixas vermelhas nos joelhos.</p><p>A alegria chega suavemente.</p><p>E favorece aquele que fizer oferendas e libações</p><p></p><p>6</p><p>Seis no topo significa:</p><p>Ele é oprimido por vides trepadeiras. Ele move-se incertamente e diz, \"Movimento traz remorso.\"</p><p>Se alguém sentir remorso por isto e resolver começar,</p><p>Boa fortuna chega.</p><p></p><p>Apesar da interessante relação visual entre ambos os hexagramas, é curioso observar também que enquanto em Exaustão estamos estagnados e parados e devemos sacrificar-nos e refletir sobre a nossa situação para efetivamente podermos iniciar-nos. Já o Errante, logo na sua conceção, traz essa ideia de movimento e começo. De uma forma mais literal, e algo anedótica, associada à programação, poderá indicar trabalhos de freelancer e essa qualidade deambulante. </p><p></p><p>O julgamento é algo perentório e simples. A perseverança traz boa fortuna ao errante. Portanto, aquele que deambula e se aventura é beneficiado. Poderá ser uma alegoria para os benefícios das jornadas e também de trabalharmos por nossa conta e do risco, e potencial, associados.</p><p></p><p>O fogo na montanha é a imagem do errante, poderá tanto ser farol para o viajante, como um auspício mais destrutivo. Remete-nos para cautelas na imposição de castigos e na prolonga de conflitos. Devemos ser cautelosos e astutos quando erramos por aí, deveremos evitar alimentar situações ou condições que nos possam colocar em riscos ou situações desagradáveis. O errante deve ser respeitoso e justo. </p><p></p><p>A primeira linha avisa o errante para não se ocupar com coisas triviais com o risco de trazer má sorte. Revejo-me nisto, e no tempo que muitas vezes perco a fazer coisas que não contribuem nem constituem o sacrifício que referi anteriormente para a Exaustão. Mais uma vez, a necessidade de manter uma perspetiva lúcida, estando errante e por mim, terei de ser lúcido e diligente nas minhas rotinas.</p><p></p><p>Na segunda linha o viajante decide para numa estalagem com os seus pertences e tem a fidelidade de alguém. Um período bom, em que no meio da sua viagem, o homem para para descansar e acaba por ficar por uns tempos, sendo as condições propícias a tal. </p><p></p><p>A terceira linha avisa-nos para perigos. A estalagem e essas condições propícias perdem-se, tal como a fidelidade do seu servo. Há perigo e urgência. O errante estava confortável e viu-se surpreendido por uma situação que altera por completo as suas circunstâncias. Não só um aviso para a dependência da lucidez e da cautela e para a fatalidade de certos eventos que poderão fazer-nos perder o chão. Ocorreram no passado, e é natural que voltem a ocorrer. Manter a lucidez e a cautela, e quando estas não chegam, importa perceber que noutras situações outros infortúnios mudaram as condições do jogo, mas a nossa adaptabilidade levou a melhor. </p><p></p><p>Na quarta linha, apesar de encontrar abrigo e de recuperar os seus pertences, ele não está alegre, pois apercebeu-se do perigo da viagem, de ser um estranho em terras estranhas. O machado simboliza essa qualidade defensiva. Voltando à anedota, os trabalhos vão surgindo, por vezes vale a pena começar a ter trabalhos estáveis com certas pessoas, todavia isso pode conduzir a problemas e dependências que poderão afetar a nossa autonomia e capacidade de sermos resilientes face a problemas. A consciência de que é preciso algum estofo quando trabalhamos para nós mesmos em algo em que ainda por cima não estamos completamente à vontade.</p><p></p><p>Na quinta linha, o errante mostra as suas habilidades ao atirar num faisão e isso traz-lhe algum reconhecimento. Deixa de ser estrangeiros, e novamente sente-se integrado, desta vez com o reconhecimento das pessoas. </p><p></p><p>Contudo, na última linha, este auspício pode ser seguido de infortúnio. O ninho de faisões arde e num momento de hubris o errante ri, lamentando-se e chorando depois. Todavia, por descuido ele perde a sua vaca o que se manifesta no infortúnio. No fundo, uma cautela para o excesso de confiança e para o tratamento desigual, foi daquele ninho que surgiu o faisão em que ele disparou, e, hipoteticamente, foi isso que lhe deu uma vaca. Há aqui um círculo quase picaresco. A vaca pode pressupor estabilidade, em que o errante após o sucesso prévio acabou por ficar. E desta vez, não por acidente, mas por falta de lucidez e sobriedade, a sua soberba relativamente ao faisão. O faisão também poderá ter dimensões simbólicos frutíferas, em que pode servir de substituto para a própria condição de errante, em que o riso indica um aparente afastamento da condição de errante e do mundo natural em geral, enquanto par e não enquanto posse. </p><ol start=\"56\"><li><p>56.</p></li><li><p></p></li><li><p>Julgamento</p></li><li><p>O ERRANTE. Sucesso através do simples.</p></li><li><p>Perseverança traz boa fortuna</p></li><li><p>Ao errante</p></li></ol><p></p><p>Imagem</p><p>Fogo na montanha:</p><p>A imagem do ERRANTE</p><p>Assim o homem superior</p><p>É lúcido e cauteloso ao impor castigos,</p><p>E não prolonga disputas judiciais.</p><p></p><p>1</p><p>Seis no início significa:</p><p>Se o errante se ocupar com coisas triviais,</p><p>Ele atrai infortúnios sobre si mesmo.</p><p></p><p>2</p><p>Seis na segunda casa significa:</p><p>O errante chega a uma estalagem.</p><p>Ele tem os seus pertences consigo.</p><p>Ele conquista a fidelidade de um jovem servo.</p><p></p><p>3</p><p>Nove no terceiro lugar significa:</p><p>A estalagem do errante ardeu num fogo.</p><p>Ele perde a fidelidade do seu jovem servo.</p><p>Perigo.</p><p></p><p>4</p><p>Nove no quarto lugar significa:</p><p>O errante descansa num abrigo.</p><p>Ele recupera os seus pertences e um machado.</p><p>O meu coração não está alegre.</p><p>Ele está persistentemente consciente de ser um estranho em terras estranhas</p><p></p><p>5</p><p>Seis no quinto lugar significa:</p><p>Ele atirou um faisão.</p><p>Caiu com a primeira flecha.</p><p>No fim, isso traz elogios e posições.</p><p></p><p>6</p><p>Nove no topo significa:</p><p>O ninho do pássaro arde.</p><p>O errante inicialmente ri,</p><p>Mas depois deve lamentar e chorar.</p><p>Por descuido ele perde a sua vaca.</p><p>Infortúnio.</p>",
    "originalHexagram": {
      "binary": "010110",
      "details": {
        "image": [
          "There is no water in the lake:",
          "The image of EXHAUSTION.",
          "Thus the superior man stakes his life",
          "On following his will."
        ],
        "judgment": [
          "OPPRESSION. Success. Perseverance.",
          "The great man brings about good fortune.",
          "No blame.",
          "When one has something to say,",
          "It is not believed."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Six at the beginning means:",
              "One sits oppressed under a bare tree",
              "And strays into a gloomy valley.",
              "For three years one sees nothing."
            ]
          },
          {
            "position": 2,
            "text": [
              "Nine in the second place means:",
              "One is oppressed while at meat and drink.",
              "The man with the scarlet knee bands is just coming.",
              "It furthers one to offer sacrifice.",
              "To set forth brings misfortune.",
              "No blame."
            ]
          },
          {
            "position": 3,
            "text": [
              "Six in the third place means:",
              "A man permits himself to be oppressed by stone,",
              "And leans on thorns and thistles.",
              "He enters his house and does not see his wife.",
              "Misfortune."
            ]
          },
          {
            "position": 4,
            "text": [
              "Nine in the fourth place means:",
              "He comes very quietly, oppressed in a golden carriage.",
              "Humiliation, but the end is reached."
            ]
          },
          {
            "position": 5,
            "text": [
              "Nine in the fifth place means:",
              "His nose and feet are cut off.",
              "Oppression at the hands of the man with the purpleknee bands.",
              "Joy comes softly.",
              "It furthers one to make offerings and libations."
            ]
          },
          {
            "position": 6,
            "text": [
              "Six at the top means:",
              "He is oppressed by creeping vines. He moves uncertainly and says, “Movement brings remorse.”",
              "If one feels remorse over this and makes a start,",
              "Good fortune comes."
            ]
          }
        ]
      },
      "info": "Represents oppression or exhaustion, urging one to seek liberation and relief.",
      "name": "K'un / Oppression (Exhaustion)",
      "number": 47,
      "unicode": "䷮"
    },
    "mutantHexagram": {
      "binary": "001101",
      "details": {
        "image": [
          "Fire on the mountain:",
          "The image of THE WANDERER.",
          "Thus the superior man",
          "Is clear-minded and cautious In imposing penalties,",
          "And protracts no lawsuits."
        ],
        "judgment": [
          "THE WANDERER. Success through smallness.",
          "Perseverance brings good fortune",
          "To the wanderer."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Six at the beginning means:",
              "If the wanderer busies himself with trivial things,",
              "He draws down misfortune upon himself."
            ]
          },
          {
            "position": 2,
            "text": [
              "Six in the second place means:",
              "The wanderer comes to an inn.",
              "He has his property with him.",
              "He wins the steadfastness¹ of a young servant."
            ]
          },
          {
            "position": 3,
            "text": [
              "Nine in the third place means:",
              "The wanderer’s inn burns down.",
              "He loses the steadfastness of his young servant.",
              "Danger."
            ]
          },
          {
            "position": 4,
            "text": [
              "Nine in the fourth place means:",
              "The wanderer rests in a shelter.",
              "He obtains his property and an ax.",
              "My heart is not glad."
            ]
          },
          {
            "position": 5,
            "text": [
              "He is persistently conscious of being a stranger in a strange land.",
              "Six in the fifth place means: He shoots a pheasant.",
              "It drops with the first arrow.",
              "In the end this brings both praise and office."
            ]
          },
          {
            "position": 6,
            "text": [
              "Nine at the top means:",
              "The bird’s nest burns up.",
              "The wanderer laughs at first,",
              "Then must needs lament and weep.",
              "Through carelessness he loses his cow.",
              "Misfortune."
            ]
          }
        ]
      },
      "info": "Signifies a journey or pilgrimage, urging one to seek adventure and new experiences.",
      "name": "Lü / The Wanderer",
      "number": 56,
      "unicode": "䷷"
    },
    "createdAt": "2025-07-06T00:12:25.380Z",
    "id": "be754c4b-8395-4063-8df9-063d9fe0e11a"
  },
  {
    "question": "Sucesso",
    "notes": "<p>asdas</p>",
    "originalHexagram": {
      "binary": "100010",
      "details": {
        "image": [
          "Clouds and thunder:",
          "The image of Difficulty at the Beginning.",
          "Thus the superior man",
          "Brings order out of confusion."
        ],
        "judgment": [
          "Difficulty at the Beginning works supreme success,",
          "Furthering through perseverance.",
          "Nothing should be undertaken.",
          "It furthers one to appoint helpers."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "○ Nine at the beginning means:",
              "Hesitation and hindrance.",
              "It furthers one to remain persevering.",
              "It furthers one to appoint helpers."
            ]
          },
          {
            "position": 2,
            "text": [
              "Six in the second place means:",
              "Difficulties pile up.",
              "Horse and wagon part.",
              "He is not a robber;",
              "He wants to woo when the time comes.",
              "The maiden is chaste,",
              "She does not pledge herself.",
              "Ten years—then she pledges herself.¹"
            ]
          },
          {
            "position": 3,
            "text": [
              "Six in the third place means:",
              "Whoever hunts deer without the forester",
              "Only loses his way in the forest.",
              "The superior man understands the signs of the time",
              "And prefers to desist.",
              "To go on brings humiliation."
            ]
          },
          {
            "position": 4,
            "text": [
              "Six in the fourth place means:",
              "Horse and wagon part.",
              "Strive for union.",
              "To go brings good fortune.",
              "Everything acts to further."
            ]
          },
          {
            "position": 5,
            "text": [
              "○ Nine in the fifth place means:",
              "Difficulties in blessing.",
              "A little perseverance brings good fortune.",
              "Great perseverance brings misfortune."
            ]
          },
          {
            "position": 6,
            "text": [
              "Six at the top means:",
              "Horse and wagon part.",
              "Bloody tears flow."
            ]
          }
        ]
      },
      "info": "Indicates that there will be difficulties at the beginning, but success will come through perseverance.",
      "name": "Chun / Difficulty at the Beginning",
      "number": 3,
      "unicode": "䷂"
    },
    "mutantHexagram": {
      "binary": "100100",
      "details": {
        "image": [
          "Thunder repeated: the image of SHOCK.",
          "Thus in fear and trembling",
          "The superior man sets his life in order",
          "And examines himself."
        ],
        "judgment": [
          "SHOCK brings success.",
          "Shock comes—oh, oh!",
          "Laughing words—ha, ha!",
          "The shock terrifies for a hundred miles,",
          "And he does not let fall the sacrificial spoon and chalice."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Nine at the beginning means:",
              "Shock comes—oh, oh!",
              "Then follow laughing words—ha, ha!",
              "Good fortune."
            ]
          },
          {
            "position": 2,
            "text": [
              "Six in the second place means:",
              "Shock comes bringing danger.",
              "A hundred thousand times",
              "You lose your treasures",
              "And must climb the nine hills.",
              "Do not go in pursuit of them.",
              "After seven days you will get them back again."
            ]
          },
          {
            "position": 3,
            "text": [
              "Six in the third place means:",
              "Shock comes and makes one distraught.",
              "If shock spurs to action",
              "One remains free of misfortune."
            ]
          },
          {
            "position": 4,
            "text": [
              "Nine in the fourth place means:",
              "Shock is mired."
            ]
          },
          {
            "position": 5,
            "text": [
              "Six in the fifth place means:",
              "Shock goes hither and thither.",
              "Danger.",
              "However, nothing at all is lost.",
              "Yet there are things to be done."
            ]
          },
          {
            "position": 6,
            "text": [
              "Six at the top means:",
              "Shock brings ruin and terrified gazing around.",
              "Going ahead brings misfortune.",
              "If it has not yet touched one’s own body",
              "But has reached one’s neighbor first,",
              "There is no blame.",
              "One’s comrades have something to talk about."
            ]
          }
        ]
      },
      "info": "Signifies gradual progress and development, urging one to persevere in the face of obstacles.",
      "name": "Chên / Development (Gradual Progress)",
      "number": 51,
      "unicode": "䷲"
    },
    "createdAt": "2025-07-06T02:17:18.466Z",
    "id": "2eabab9a-26fd-4aa0-810e-9d5c08226dd8"
  },
  {
    "question": "O que almoçar amanhã?",
    "notes": "",
    "originalHexagram": {
      "binary": "110100",
      "details": {
        "image": [
          "Thunder over the lake:",
          "The image of THE MARRYING MAIDEN.",
          "Thus the superior man",
          "Understands the transitory",
          "In the light of the eternity of the end."
        ],
        "judgment": [
          "THE MARRYING MAIDEN.",
          "Undertakings bring misfortune.",
          "Nothing that would further."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Nine at the beginning means:",
              "The marrying maiden as a concubine.",
              "A lame man who is able to tread.",
              "Undertakings bring good fortune."
            ]
          },
          {
            "position": 2,
            "text": [
              "Nine in the second place means:",
              "A one-eyed man who is able to see.",
              "The perseverance of a solitary man furthers."
            ]
          },
          {
            "position": 3,
            "text": [
              "Six in the third place means:",
              "The marrying maiden as a slave.",
              "She marries as a concubine."
            ]
          },
          {
            "position": 4,
            "text": [
              "Nine in the fourth place means:",
              "The marrying maiden draws out the allotted time.",
              "A late marriage comes in due course."
            ]
          },
          {
            "position": 5,
            "text": [
              "Six in the fifth place means:",
              "The sovereign I gave his daughter in marriage.",
              "The embroidered garments of the princess",
              "Were not as gorgeous",
              "As those of the servingmaid.",
              "The moon that is nearly full",
              "Brings good fortune."
            ]
          },
          {
            "position": 6,
            "text": [
              "Six at the top means:",
              "The woman holds the basket, but there are no fruits in it.",
              "The man stabs the sheep, but no blood flows.",
              "Nothing that acts to further."
            ]
          }
        ]
      },
      "info": "Emphasizes the importance of timing and preparation, especially in matters of relationships.",
      "name": "Kuei Mei / The Marrying Maiden",
      "number": 54,
      "unicode": "䷵"
    },
    "mutantHexagram": {
      "binary": "110000",
      "details": {
        "image": [
          "The earth above the lake:",
          "The image of APPROACH.",
          "Thus the superior man is inexhaustible In his will to teach,",
          "And without limits",
          "In his tolerance and protection of the people."
        ],
        "judgment": [
          "APPROACH has supreme success.",
          "Perseverance furthers.",
          "When the eighth month comes,",
          "There will be misfortune."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Nine at the beginning means:",
              "Joint approach.",
              "Perseverance brings good fortune."
            ]
          },
          {
            "position": 2,
            "text": [
              "Nine in the second place means:",
              "Joint approach.",
              "Good fortune.",
              "Everything furthers."
            ]
          },
          {
            "position": 3,
            "text": [
              "Six in the third place means:",
              "Comfortable approach.",
              "Nothing that would further.",
              "If one is induced to grieve over it,",
              "One becomes free of blame."
            ]
          },
          {
            "position": 4,
            "text": [
              "Six in the fourth place means:",
              "Complete approach.",
              "No blame."
            ]
          },
          {
            "position": 5,
            "text": [
              "Six in the fifth place means:",
              "Wise approach.",
              "This is right for a great prince.",
              "Good fortune."
            ]
          },
          {
            "position": 6,
            "text": [
              "Six at the top means:",
              "Greathearted approach.",
              "Good fortune.",
              "No blame."
            ]
          }
        ]
      },
      "info": "Signifies the approach of something new or different, urging one to be open-minded.",
      "name": "Lin / Approach",
      "number": 19,
      "unicode": "䷒"
    },
    "createdAt": "2025-07-06T21:21:38.758Z",
    "id": "08b47c0a-c16f-4e8a-8ce9-f6e0dabc1c1a"
  },
  {
    "question": "Testar",
    "notes": "<p>asdasd</p>",
    "originalHexagram": {
      "binary": "000000",
      "details": {
        "image": [
          "The earth’s condition is receptive devotion.",
          "Thus the superior man who has breadth of character",
          "Carries the outer world."
        ],
        "judgment": [
          "THE RECEPTIVE brings about sublime success,",
          "Furthering through the perseverance of a mare.",
          "If the superior man undertakes something and tries to lead,",
          "He goes astray;",
          "But if he follows, he finds guidance.",
          "It is favorable to find friends in the west and south,",
          "To forego friends in the east and north.",
          "Quiet perseverance brings good fortune."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Six at the beginning means:",
              "When there is hoarfrost underfoot,",
              "Solid ice is not far off."
            ]
          },
          {
            "position": 2,
            "text": [
              "○ Six in the second place means:",
              "Straight, square, great.",
              "Without purpose,",
              "Yet nothing remains unfurthered."
            ]
          },
          {
            "position": 3,
            "text": [
              "Six in the third place means:",
              "Hidden lines.",
              "One is able to remain persevering.",
              "If by chance you are in the service of a king,",
              "Seek not works, but bring to completion."
            ]
          },
          {
            "position": 4,
            "text": [
              "Six in the fourth place means:",
              "A tied-up sack. No blame, no praise."
            ]
          },
          {
            "position": 5,
            "text": [
              "Six in the fifth place means:",
              "A yellow lower garment brings supreme good fortune."
            ]
          },
          {
            "position": 6,
            "text": [
              "Six at the top means:",
              "Dragons fight in the meadow.",
              "Their blood is black and yellow."
            ]
          }
        ]
      },
      "info": "Symbolizes the receptive, yielding, and devoted.",
      "name": "K'un / The Receptive",
      "number": 2,
      "unicode": "䷁"
    },
    "mutantHexagram": {
      "binary": "000100",
      "details": {
        "image": [
          "Thunder comes resounding out of the earth:",
          "The image of ENTHUSIASM.",
          "Thus the ancient kings made music In order to honor merit,",
          "And offered it with splendor",
          "To the Supreme Deity,",
          "Inviting their ancestors to be present."
        ],
        "judgment": [
          "ENTHUSIASM. It furthers one to install helpers",
          "And to set armies marching."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Six at the beginning means:",
              "Enthusiasm that expresses itself",
              "Brings misfortune."
            ]
          },
          {
            "position": 2,
            "text": [
              "Six in the second place means:",
              "Firm as a rock. Not a whole day.",
              "Perseverance brings good fortune."
            ]
          },
          {
            "position": 3,
            "text": [
              "Six in the third place means:",
              "Enthusiasm that looks upward creates remorse.",
              "Hesitation brings remorse."
            ]
          },
          {
            "position": 4,
            "text": [
              "Nine in the fourth place means:",
              "The source of enthusiasm.",
              "He achieves great things.",
              "Doubt not.",
              "You gather friends around you",
              "As a hair clasp gathers the hair."
            ]
          },
          {
            "position": 5,
            "text": [
              "Six in the fifth place means:",
              "Persistently ill, and still does not die."
            ]
          },
          {
            "position": 6,
            "text": [
              "Six at the top means:",
              "Deluded enthusiasm.",
              "But if after completion one changes,",
              "There is no blame."
            ]
          }
        ]
      },
      "info": "Signifies enthusiasm and eagerness, encouraging bold action.",
      "name": "Yu / Enthusiasm",
      "number": 16,
      "unicode": "䷏"
    },
    "createdAt": "2025-07-06T21:39:39.631Z",
    "id": "be245fcb-0ae7-4417-84b3-9048dbed5927"
  },
  {
    "question": "Escrever poemas ainda vale a pena?",
    "notes": "<p>53</p><p></p><p>Julgamento</p><p>Desenvolvimento. A solteira casa-se. Boa fortuna. A perseverança apraz. As coisas resolvem-se e novas fases chegam. O desenvolvimento acontece quando surgem as condições para que este possa ocorrer, mas chegando a oportunidade ele acontece. </p><p></p><p>Imagem</p><p>Na montanha, uma árvore. A imagem de desenvolvimento. Assim o homem superior cumpre com dignidade e virtude, em ordem a melhorar os costumes. A árvore brava na montanha, crescendo entre rochedos e escarpas, erodindo a montanha eterna numa vida só. Assim também é o homem que, muitas vezes moldado por tempos difíceis, se torna um farol, um exemplo de virtude e dignidade para o qual outros olham e veem valor.  </p><p></p><p>1</p><p>Seis no início. O ganso selvagem vai-se aproximando da costa. O filho pequeno está em perigo. Existem conversas. Sem culpa. As aves chegando à terra e o seu pronúncio, como a gaivota trazendo a tempestade, o ganso na margem traz o perigo. A diplomacia e o comportamento importam, a comunicação pode ser importante para lidar com o perigo.</p><p></p><p>2</p><p>Seis no segundo lugar. O ganso selvagem aproxima-se da arriba. Comamos e bebamos em paz e concordância. Boa fortuna. A arriba protege a terra do mar, e o ganso selvagem do homem. Podemos estar descansados, o perigo parece estar controlado. </p><p></p><p>3</p><p>Nove no terceiro lugar. O ganso selvagem vai-se aproximando do planalto. O homem vai e não volta. A mulher carrega uma criança mas não dá à luz. Má fortuna. Leva-nos a afastar os ladrões. O homem desaparece e o filho não chega ao final da gestão. Grandes infortúnios. Devemos afastar quem nos procura mal e tentar reencontrar-nos no meio das adversidades.</p><p></p><p>4</p><p>Seis no quarto lugar. O ganso selvagem aproxima-se de uma árvore. Talvez encontre um ramo raso. Sem culpa. </p><p></p><p>Por acabar</p><p></p><p></p><p>Line 3</p><p>Nine in the third place means:</p><p>The wild goose gradually draws near the plateau.</p><p>The man goes forth and does not return.</p><p>The woman carries a child but does not bring it forth.</p><p>Misfortune.</p><p>It furthers one to fight off robbers.</p><p>Line 4</p><p>Six in the fourth place means:</p><p>The wild goose gradually draws near the tree.</p><p>Perhaps it will find a flat branch. No blame.</p><p>Line 5</p><p>Nine in the fifth place means:</p><p>The wild goose gradually draws near the summit.</p><p>For three years the woman has no child.</p><p>In the end nothing can hinder her.</p><p>Good fortune.</p><p>Line 6</p><p>Nine at the top means:</p><p>The wild goose gradually draws near the cloud heights.</p><p>Its feathers can be used for the sacred dance.</p><p>Good fortune.</p><p></p><p>39</p><p></p><p>Julgamento</p><p>Obstrução. O sudoeste abençoa, o noroeste não. O vento a noroeste é frio em Santa Cruz, o sudoeste para mim é só uma reminiscência de férias e uma infância felizes. O grande homem é naturalmente o meu pai, que me mostrou o calor de uma e o frio de outra, com justiça. A perseverança é, naturalmente, afortunada. </p><p></p><p>Imagem</p><p>Água na montanha. Obstrução. Assim o homem superior torna a sua atenção para si mesmo e molda o seu carácter. A água e as montanhas, o Zêzere e a Estrela, o nevoeiro, os recortes, as paredes de pedra, as reentrâncias e os musgos. Um lugar assim convida à introspeção e ao conhecimento próprio e do tao, particularmente na forma como ele molda tudo o que é transiente, sejamos nós, as montanhas ou os rios. </p><p></p><p>Linhas</p><p></p><p>1</p><p>O seis no início. A partida causa obstruções, a chegada é recebida com louvores. É tempo de ficar ou de voltar, as condições são adversas para partir sem destino. Os louvores estão em casa nesta circunstância. </p><p></p><p>2</p><p>O seis no segundo lugar. O servente do rei é assaltado por obstrução atrás de obstrução, não sendo culpa dele. Por vezes os impedimentos amontoam-se, tornando as coisas difíceis. É particularmente frustrante quando as circunstâncias adversas são alheias a nós, pois nada podemos fazer. Todavia é tempo para crescer, para superar os problemas e aprender.</p><p></p><p>3</p><p>Nove no terceiro lugar. Partir leva a impedimentos, e por isso ele volta. A ideia de partir e de chegar, como se estivéssemos sempre entre essa dualidade, de sair e entrar, do conhecido e o desconhecido. É tempo de voltar.</p><p></p><p>4</p><p>Seis no quarto lugar. Partir leva a impedimentos. Chegar traz união. A chegada está associada geralmente ao conhecido, ao retorno a algum sítio que nos é familiar e onde podemos fazer da força de todos a força de um. </p><p></p><p>5</p><p>Nove no quinto lugar. No meio de grandes impedimentos, os amigos chegam. Quando partir não é propicio, a chegada de amigos em tempos adversos ainda traz mais união e potencial.</p><p></p><p>6</p><p>Seis no topo. Partir leva a obstruções. Chegar leva a uma enorme fortuna. Leva-nos a procurar o grande homem. Novamente, a partida como desaconselhável, mas a chegada como boa fortuna. Devemos procurar o grande homem que existe em nós, e moldar-nos naquilo que temos. As adversidades podem ser superadas.  </p><p></p>",
    "originalHexagram": {
      "binary": "001010",
      "details": {
        "image": [
          "Water on the mountain:",
          "The image of OBSTRUCTION.",
          "Thus the superior man turns his attention to himself",
          "And molds his character."
        ],
        "judgment": [
          "OBSTRUCTION. The southwest furthers.",
          "The northeast does not further.",
          "It furthers one to see the great man.",
          "Perseverance brings good fortune."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Six at the beginning means:",
              "Going leads to obstructions,",
              "Coming meets with praise."
            ]
          },
          {
            "position": 2,
            "text": [
              "Six in the second place means:",
              "The king’s servant is beset by obstruction upon obstruction,",
              "But it is not his own fault."
            ]
          },
          {
            "position": 3,
            "text": [
              "Nine in the third place means:",
              "Going leads to obstructions;",
              "Hence he comes back."
            ]
          },
          {
            "position": 4,
            "text": [
              "Six in the fourth place means:",
              "Going leads to obstructions,",
              "Coming leads to union."
            ]
          },
          {
            "position": 5,
            "text": [
              "Nine in the fifth place means:",
              "In the midst of the greatest obstructions,",
              "Friends come."
            ]
          },
          {
            "position": 6,
            "text": [
              "Six at the top means:",
              "Going leads to obstructions,",
              "Coming leads to great good fortune.",
              "It furthers one to see the great man."
            ]
          }
        ]
      },
      "info": "Represents obstacles or hindrances, urging one to persevere and overcome challenges.",
      "name": "Chien / Obstruction",
      "number": 39,
      "unicode": "䷦"
    },
    "mutantHexagram": {
      "binary": "001011",
      "details": {
        "image": [
          "On the mountain, a tree:",
          "The image of DEVELOPMENT.",
          "Thus the superior man abides in dignity and virtue,",
          "In order to improve the mores."
        ],
        "judgment": [
          "DEVELOPMENT. The maiden",
          "Is given in marriage.",
          "Good fortune.",
          "Perseverance furthers."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Six at the beginning means:",
              "The wild goose gradually draws near the shore.",
              "The young son is in danger.",
              "There is talk. No blame."
            ]
          },
          {
            "position": 2,
            "text": [
              "Six in the second place means:",
              "The wild goose gradually draws near the cliff.",
              "Eating and drinking in peace and concord.",
              "Good fortune."
            ]
          },
          {
            "position": 3,
            "text": [
              "Nine in the third place means:",
              "The wild goose gradually draws near the plateau.",
              "The man goes forth and does not return.",
              "The woman carries a child but does not bring it forth.",
              "Misfortune.",
              "It furthers one to fight off robbers."
            ]
          },
          {
            "position": 4,
            "text": [
              "Six in the fourth place means:",
              "The wild goose gradually draws near the tree.",
              "Perhaps it will find a flat branch. No blame."
            ]
          },
          {
            "position": 5,
            "text": [
              "Nine in the fifth place means:",
              "The wild goose gradually draws near the summit.",
              "For three years the woman has no child.",
              "In the end nothing can hinder her.",
              "Good fortune."
            ]
          },
          {
            "position": 6,
            "text": [
              "Nine at the top means:",
              "The wild goose gradually draws near the cloud heights.",
              "Its feathers can be used for the sacred dance.",
              "Good fortune."
            ]
          }
        ]
      },
      "info": "Signifies gradual progress and development, urging one to persevere in the face of obstacles.",
      "name": "Chien / Development (Gradual Progress)",
      "number": 53,
      "unicode": "䷴"
    },
    "createdAt": "2025-07-06T23:20:53.683Z",
    "id": "ea357ba8-c493-4b18-8539-1eee175d8574"
  },
  {
    "question": "Como é que vai ser o meu dia hoje?",
    "notes": "<p>Muito bonito</p>",
    "originalHexagram": {
      "binary": "011001",
      "details": {
        "image": [
          "The wind blows low on the mountain:",
          "The image of DECAY.",
          "Thus the superior man stirs up the people",
          "And strengthens their spirit."
        ],
        "judgment": [
          "WORK ON WHAT HAS BEEN SPOILED",
          "Has supreme success.",
          "It furthers one to cross the great water.",
          "Before the starting point, three days.",
          "After the starting point, three days."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Six at the beginning means:",
              "Setting right what has been spoiled by the father.",
              "If there is a son,",
              "No blame rests upon the departed father.",
              "Danger. In the end good fortune."
            ]
          },
          {
            "position": 2,
            "text": [
              "Nine in the second place means:",
              "Setting right what has been spoiled by the mother.",
              "One must not be too persevering."
            ]
          },
          {
            "position": 3,
            "text": [
              "Nine in the third place means:",
              "Setting right what has been spoiled by the father.",
              "There will be a little remorse. No great blame."
            ]
          },
          {
            "position": 4,
            "text": [
              "Six in the fourth place means:",
              "Tolerating what has been spoiled by the father.",
              "In continuing one sees humiliation."
            ]
          },
          {
            "position": 5,
            "text": [
              "Six in the fifth place means:",
              "Setting right what has been spoiled by the father.",
              "One meets with praise."
            ]
          },
          {
            "position": 6,
            "text": [
              "Nine at the top means:",
              "He does not serve kings and princes,",
              "Sets himself higher goals."
            ]
          }
        ]
      },
      "info": "Calls for addressing and correcting what has been neglected or spoiled.",
      "name": "Ku / Work on What Has Been Spoiled [Decay]",
      "number": 18,
      "unicode": "䷑"
    },
    "mutantHexagram": {
      "binary": "000001",
      "details": {
        "image": [
          "The mountain rests on the earth:",
          "The image of SPLITTING APART.",
          "Thus those above can ensure their position",
          "Only by giving generously to those below."
        ],
        "judgment": [
          "SPLITTING APART. It does not further one",
          "To go anywhere."
        ],
        "lines": [
          {
            "position": 1,
            "text": [
              "Six at the beginning means:",
              "The leg of the bed is split.",
              "Those who persevere are destroyed.",
              "Misfortune."
            ]
          },
          {
            "position": 2,
            "text": [
              "Six in the second place means:",
              "The bed is split at the edge.",
              "Those who persevere are destroyed.",
              "Misfortune."
            ]
          },
          {
            "position": 3,
            "text": [
              "Six in the third place means:",
              "He splits with them.",
              "No blame."
            ]
          },
          {
            "position": 4,
            "text": [
              "Six in the fourth place means:",
              "The bed is split up to the skin.",
              "Misfortune."
            ]
          },
          {
            "position": 5,
            "text": [
              "Six in the fifth place means:",
              "A shoal of fishes.",
              "Favor comes through the court ladies.",
              "Everything acts to further."
            ]
          },
          {
            "position": 6,
            "text": [
              "Nine at the top means:",
              "There is a large fruit still uneaten.",
              "The superior man receives a carriage.",
              "The house of the inferior man is split apart."
            ]
          }
        ]
      },
      "info": "Indicates a time of division or separation, urging one to seek unity and reconciliation.",
      "name": "Po / Splitting Apart",
      "number": 23,
      "unicode": "䷖"
    },
    "createdAt": "2025-07-11T14:11:45.785Z",
    "id": "98de486a-ca55-4cbf-8443-9d84b8e3ed89"
  }
]